app/views/matches/_user_fields.html.erb


    <%= f.select :user_id , User.all.collect{|e| [e.email, e.id]} %>
---
SELECT "users".* FROM "users"