app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" ORDER BY created_at DESC
---
  def index
    @matches = Match.all

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def show
    @match = Match.find(params[:id])

INSERT INTO "matches" ("created_at", "name", "sport_id", "time", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 15 Jan 2013 14:52:20 UTC +00:00], ["name", "tess"], ["sport_id", nil], ["time", nil], ["updated_at", Tue, 15 Jan 2013 14:52:20 UTC +00:00]]
---
  def create
    @match = Match.new(params[:match])
    if @match.save

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "8"]]
---
  def edit
    @match = Match.find(params[:id])

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "7"]]
UPDATE "matches" SET "name" = 'testsdfdfsd eee', "updated_at" = '2013-01-15 15:18:04.792172' WHERE "matches"."id" = 8
---
  def update
    @match = Match.find(params[:id])
    if @match.update_attributes(params[:match])

SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "22"]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 22]]
---
  def destroy
    @match = Match.find(params[:id])
    @match.destroy