app/controllers/sports_controller.rb

INSERT INTO "sports" ("content", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @sport = Sport.new(params[:sport])

    respond_to do |format|
      if @sport.save