app/controllers/statuses_controller.rb

  def create
    @status = Status.new(params[:status])
    @match = Match.find(@status.match_id)
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", :match_id]]