app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "teams" SET "result" = 'Win', "updated_at" = '2013-01-22 07:21:36.059390' WHERE "teams"."id" = 1
---
  def update
    #binding.pry
    @team = Team.find(params[:id])
    #if @team.update_attributes(:result => params[:result])
    if @team.update_attributes(params[:team])